In [3]:
##conda install -c conda-forge ipython-sql=0.3.6
##pip install ipython-sql

##%%capture
%load_ext sql
%sql sqlite:///factbook.db

In [4]:
%%sql
SELECT * FROM facts LIMIT 5;

 * sqlite:///factbook.db
Done.

[(1, 'af', 'Afghanistan', 652230, 652230, 0, 32564342, 2.32, 38.57, 13.89, 1.51),
 (2, 'al', 'Albania', 28748, 27398, 1350, 3029278, 0.3, 12.92, 6.58, 3.3),
 (3, 'ag', 'Algeria', 2381741, 2381741, 0, 39542166, 1.84, 23.67, 4.31, 0.92),
 (4, 'an', 'Andorra', 468, 468, 0, 85580, 0.12, 8.13, 6.96, 0.0),
 (5, 'ao', 'Angola', 1246700, 1246700, 0, 19625353, 2.78, 38.78, 11.49, 0.46)]

In [5]:
%%sql
SELECT MIN(population) Minimum_population,
MAX(population) Maximum_population,
MIN(population_growth)Minimum_population_growth,
MAX(population_growth) Maximum_population_growth
FROM facts

 * sqlite:///factbook.db
Done.

[(0, 7256490011, 0.0, 4.02)]

In [6]:
%%sql
SELECT name, population
FROM facts
GROUP BY name
ORDER BY population desc 
limit 10

 * sqlite:///factbook.db
Done.

[('World', 7256490011),
 ('China', 1367485388),
 ('India', 1251695584),
 ('European Union', 513949445),
 ('United States', 321368864),
 ('Indonesia', 255993674),
 ('Brazil', 204259812),
 ('Pakistan', 199085847),
 ('Nigeria', 181562056),
 ('Bangladesh', 168957745)]

In [7]:
%%sql
SELECT name, population
FROM facts
GROUP BY name
ORDER BY population asc 
limit 10

 * sqlite:///factbook.db
Done.

[('Arctic Ocean', None),
 ('Ashmore and Cartier Islands', None),
 ('Atlantic Ocean', None),
 ('Bouvet Island', None),
 ('British Indian Ocean Territory', None),
 ('Clipperton Island', None),
 ('Coral Sea Islands', None),
 ('French Southern and Antarctic Lands', None),
 ('Heard Island and McDonald Islands', None),
 ('Indian Ocean', None)]

In [8]:
%%sql
SELECT AVG(population),
AVG(area)
FROM facts

 * sqlite:///factbook.db
Done.

[(62094928.32231405, 555093.546184739)]

In [9]:
%%sql
SELECT name, population, area
FROM facts
WHERE population > (SELECT AVG(population)FROM facts)
AND area < (SELECT AVG(area)FROM facts)

 * sqlite:///factbook.db
Done.

[('Bangladesh', 168957745, 148460),
 ('Germany', 80854408, 357022),
 ('Japan', 126919659, 377915),
 ('Philippines', 100998376, 300000),
 ('Thailand', 67976405, 513120),
 ('United Kingdom', 64088222, 243610),
 ('Vietnam', 94348835, 331210)]